
 print("Привет, Надя!")

# phrase = input()
# print(phrase)

# phrase = input("Введите строку: ")
# print(phrase)



# name = input()
# print(" Добрый день,", name, ".", sep="") # Именованный аргумент sep, для передачи лбой другой строки, в данном случае пустой. т.к. мы хотим убрать пробел между текстом и точкой


# name = input()
# print(f"{123:0>9}") # выравнивание по правому краю, добавление нулей  до достижения длины 9 символов
# print(f"{123:0<9}") # выравнивание по левому  краю
# print(f"{123:0^9}") # выравнивание по середине краю

# print("Привет, Надя!")
# print("Как дела?")

# int_number = int(input())
# print(int_number)

# float_number = float(input())
# print(float_number)


# x = 3.89  # возвращает целое число 3
# x = int(x)
# print(x)

# width = "3.7"
# height = "2.5"
# s = float(width) * float(height) # выводит площадь в вещественном числе
# print(s)

# n = 25
# x = 0.5
# print(n + x)
# print(n - x)
# print(n/x)
# print(n**x)

# print(4/2)

# print(f"{2**0.5:.3f}") # вывод вещественных чисел с n чисел после запятой

# binary_value = "1001"   # перевод из бинарной системы счисления в десятичную.
#                         #В Python можно переводить числа между системами счисления. Если требуется перевести число из системы счисления с основанием от 2 до 36 в десятичную систему счисления, то для этого следует использовать функцию int() с двумя параметрами:
#                         #строка, представляющая запись числа в соответствующей системе счисления;
#                         #основание системы счисления.
# print(int(binary_value,2))


name = input()
print("Привет,", name)
