# for i in range(5):  #0,1,2,3,4
#     print(i)

# for c in "Hello": #char
#     print(c)

# Задание 1
n = int(input())  
if n % 2 == 0:
    print("четное")
else:
    print("не четное")


# Задание2
# day = input()
# if day == "суббота" or day == "воскресенье":
#     print("Сегодня выходной!")
# elif day == "среда":
#     print("Мне сегодня к стоматологу в 15:30")
# else:
#     print("Сегодня обычный день.")

# Задание3
# n = int(input())
# text = input()
# for _  in range(n):
#     print(text)

# Задание4
# massage = input()
# count = 0
# for i in massage:
#     if i in "аэоыиуяеёю":
#         count = count + 1
# print(count)

# Задание5

# is_correct = True
# sum = 0
# while is_correct:
#     num = int(input("Введите число: "))
#     if num < 0:
#         is_correct = False
#         break
#     sum += num  #sum = sum + num
# print(sum)
